In [10]:
import pandas as pd

In [17]:
df=pd.read_excel("f:/std.xlsx",sheet_name='std')
df

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C
4    Rohan        12       A     A

In [21]:
df=pd.read_excel("f:/std.xlsx",header=None)
df

         0         1        2      3
0    Name   Standard  Section  Grade
1   Sachin        12        A      A
2     Sonu        12        C      B
3     Monu        12        D      C
4  Kashish        12        B      C
5    Rohan        12        A      A

In [30]:
df=pd.read_excel("f:/std.xlsx",sheet_name=0,header=None)
df

         0         1        2      3
0    Name   Standard  Section  Grade
1   Sachin        12        A      A
2     Sonu        12        C      B
3     Monu        12        D      C
4  Kashish        12        B      C
5    Rohan        12        A      A

In [40]:
df=pd.read_excel("f:/exl.xlsx")
df

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C
4    Rohan        12       A     A

In [45]:
df_dict=pd.read_excel("f:/exl.xlsx",sheet_name=None)
df_dict.keys()

dict_keys(['std', 'work', 'Sheet3'])

In [46]:
d1=df_dict['std']
d2=df_dict['work']
print(d1)

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C
4    Rohan        12       A     A

In [47]:
print(d2)

     Name  Department Grade
0   Sachin         CS     A
1     Sonu         ME     B
2     Monu        ECE     C
3  Kashish         CE     C
4    Rohan        BIO     A

In [52]:
df.index=['r1','r2','r3','r4','r5']
df

      Name   Standard Section Grade
r1   Sachin        12       A     A
r2     Sonu        12       C     B
r3     Monu        12       D     C
r4  Kashish        12       B     C
r5    Rohan        12       A     A

In [53]:
df.index=['a','b','c','d','e']
df

     Name   Standard Section Grade
a   Sachin        12       A     A
b     Sonu        12       C     B
c     Monu        12       D     C
d  Kashish        12       B     C
e    Rohan        12       A     A

In [54]:
df.index=range(20,45,5)
df

      Name   Standard Section Grade
20   Sachin        12       A     A
25     Sonu        12       C     B
30     Monu        12       D     C
35  Kashish        12       B     C
40    Rohan        12       A     A

In [57]:
df.index=range(20,30,2)
df

      Name   Standard Section Grade
20   Sachin        12       A     A
22     Sonu        12       C     B
24     Monu        12       D     C
26  Kashish        12       B     C
28    Rohan        12       A     A

In [58]:
df.shape

(5, 4)

In [60]:
df.columns

Index(['Name ', 'Standard', 'Section', 'Grade'], dtype='object')

In [65]:
df=pd.read_excel("f:/exl.xlsx",nrows=4)
df

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C

In [67]:
df=pd.read_excel("f:/exl.xlsx",nrows=10)
df

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C
4    Rohan        12       A     A

In [81]:
df=pd.read_excel("f:/exl.xlsx")
df

     Name   Standard Section Grade
0   Sachin        12       A     A
1     Sonu        12       C     B
2     Monu        12       D     C
3  Kashish        12       B     C
4    Rohan        12       A     A

In [114]:
df=pd.read_excel("f:/exl.xlsx",usecols="A,B,c")
df

     Name   Standard Section
0   Sachin        12       A
1     Sonu        12       C
2     Monu        12       D
3  Kashish        12       B
4    Rohan        12       A

In [125]:
df=pd.read_csv("f:/text.txt",sep=',')
df

    python     is    a   good language
I       am  ready   to  learn       it
Bye    NaN    NaN  NaN    NaN      NaN

In [123]:
df=pd.read_csv("f:/text.txt")
df

    python     is    a   good language
I       am  ready   to  learn       it
Bye    NaN    NaN  NaN    NaN      NaN

In [11]:
df=pd.DataFrame([[101,'sonu'],[102,'monu'],[103,'Ritvik']],columns=['id','name'])
df

    id    name
0  101    sonu
1  102    monu
2  103  Ritvik

In [15]:
col=df['name']
print(type(col))

<class 'pandas.core.series.Series'>

In [16]:
col

0      sonu
1      monu
2    Ritvik
Name: name, dtype: object

In [17]:
df['id']

0    101
1    102
2    103
Name: id, dtype: int64

In [18]:
df['name']

0      sonu
1      monu
2    Ritvik
Name: name, dtype: object

In [19]:
df.name

0      sonu
1      monu
2    Ritvik
Name: name, dtype: object

In [20]:
df

    id    name
0  101    sonu
1  102    monu
2  103  Ritvik

In [21]:
df.shape

(3, 2)

In [34]:
df[['id']]

    id
0  101
1  102
2  103

In [35]:
df

    id    name
0  101    sonu
1  102    monu
2  103  Ritvik

In [36]:
df.at[1,'name']

'monu'

In [39]:
df.index=['A','B','C']
df

    id    name
A  101    sonu
B  102    monu
C  103  Ritvik

In [40]:
df.at['A','name']

'sonu'

In [41]:
df.at['C','name']

'Ritvik'

In [46]:
df.iat[2,1]

'Ritvik'

In [48]:
df.iat[-1,-1]

'Ritvik'

In [50]:
row=df.loc['A']

In [51]:
print(type(row))

<class 'pandas.core.series.Series'>

In [52]:
df.loc[['A']]

    id  name
A  101  sonu

In [53]:
df.iloc[[-1,0]]

    id    name
C  103  Ritvik
A  101    sonu

In [58]:
df=pd.read_csv("y:/restaurant.csv")
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [62]:
df.loc[1:4,'tip':'smoker']

    tip  gender smoker
1  1.66    Male     No
2  3.50    Male     No
3  3.31    Male     No
4  3.61  Female     No

In [64]:
 df.loc[[1,34,50,29],['tip','gender']]

     tip  gender
1   1.66    Male
34  3.27    Male
50  2.50    Male
29  3.00  Female

In [65]:
df.iloc[1:6,2:6]

   gender smoker  day    time
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner
5    Male     No  Sun  Dinner

In [71]:
df=pd.read_csv("Y:/restaurant.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   gender      244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [72]:
df.total_bill.std()

8.902411954856856

In [75]:
df.total_bill.mean()

19.785942622950824

In [82]:
df.total_bill.count()

244

In [77]:
df.total_bill.max()

50.81

In [73]:
df.describe(include=["int","float"])

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [90]:
df.describe(include="object")

       gender smoker  day    time
count     244    244  244     244
unique      2      2    4       2
top      Male     No  Sat  Dinner
freq      157    151   87     176

In [91]:
df.describe(include="all")

        total_bill         tip gender smoker  day    time        size
count   244.000000  244.000000    244    244  244     244  244.000000
unique         NaN         NaN      2      2    4       2         NaN
top            NaN         NaN   Male     No  Sat  Dinner         NaN
freq           NaN         NaN    157    151   87     176         NaN
mean     19.785943    2.998279    NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638    NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000    NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000    NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000    NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500    NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000    NaN    NaN  NaN     NaN    6.000000

In [92]:
df.groupby(by="day")['total_bill'].mean()

day
Fri     17.151579
Sat     20.441379
Sun     21.410000
Thur    17.682742
Name: total_bill, dtype: float64

In [93]:
df.groupby(by="day")[['total_bill']].mean()

      total_bill
day
Fri    17.151579
Sat    20.441379
Sun    21.410000
Thur   17.682742

In [94]:
df.groupby(by="day")[['total_bill']].min()

      total_bill
day
Fri         5.75
Sat         3.07
Sun         7.25
Thur        7.51

In [95]:
df.groupby(by="day")[['total_bill']].max()

      total_bill
day
Fri        40.17
Sat        50.81
Sun        48.17
Thur       43.11

In [97]:
df.groupby(by="day")[['total_bill']].agg(['mean','count','max','min'])

     total_bill
           mean count    max   min
day
Fri   17.151579    19  40.17  5.75
Sat   20.441379    87  50.81  3.07
Sun   21.410000    76  48.17  7.25
Thur  17.682742    62  43.11  7.51

In [99]:
df.groupby(by=["day","time"])[['total_bill']].agg(['mean','count','max','min'])

            total_bill
                  mean count    max    min
day  time
Fri  Dinner  19.663333    12  40.17   5.75
     Lunch   12.845714     7  16.27   8.58
Sat  Dinner  20.441379    87  50.81   3.07
Sun  Dinner  21.410000    76  48.17   7.25
Thur Dinner  18.780000     1  18.78  18.78
     Lunch   17.664754    61  43.11   7.51

In [101]:
df.groupby(by=["day","time"])[['total_bill','tip']].agg(['mean','count','max','min'])

            total_bill                           tip
                  mean count    max    min      mean count    max   min
day  time
Fri  Dinner  19.663333    12  40.17   5.75  2.940000    12   4.73  1.00
     Lunch   12.845714     7  16.27   8.58  2.382857     7   3.48  1.58
Sat  Dinner  20.441379    87  50.81   3.07  2.993103    87  10.00  1.00
Sun  Dinner  21.410000    76  48.17   7.25  3.255132    76   6.50  1.01
Thur Dinner  18.780000     1  18.78  18.78  3.000000     1   3.00  3.00
     Lunch   17.664754    61  43.11   7.51  2.767705    61   6.70  1.25